<?php

namespace App\Api;

class ShipBi extends Bi
{

    private $url = '';

    /**
     * 跟踪物流信息
     * @param int $shipNum
     * @return  array
     * @author  jas
     * @since   15点20分
     *
     * @access  public
     */
    public function expressTracking(int $shipNum): array
    {
        //模拟数据
        $data = [
            "number" => "12345678910",
            "type" => "zto",
            "typename" => "中通速递",
            "logo" => "https://api.jisuapi.com/express/static/images/logo/80/zto.png",
            "list" => [
                [
                    "time" => "2022-03-06 17:26:38",
                    "status" => "【成都市】 您的快递已签收, 签收人在【菜鸟的成都双流区万锦城新店】领取。如有疑问请电联:（18030695067）, 投诉电话:（9519666）, 您的快递已经妥投。风里来雨里去, 只为客官您满意。上有老下有小, 赏个好评好不好？【请在评价快递员处帮忙点亮五颗星星哦~】"
                ],
                [
                    "time" => "2022-03-06 10:21:38",
                    "status" => "【成都市】 快件已被【菜鸟的成都双流区万锦城新店】代收，如有问题请电联（9519666），感谢使用中通快递，期待再次为您服务！"
                ],
                [
                    "time" => "2022-03-06 06:55:57",
                    "status" => "【成都市】 【成都华阳】 的万锦城-巫仁智（18030695067） 正在第2次派件, 请保持电话畅通,并耐心等待（95720为中通快递员外呼专属号码，请放心接听）"
                ],
                [
                    "time" => "2022-03-06 06:37:14",
                    "status" => "【成都市】 快件已经到达 【成都华阳】"
                ],
                [
                    "time" => "2022-03-06 04:07:29",
                    "status" => "【成都市】 快件离开 【成都中转】 已发往 【成都华阳】"
                ],
                [
                    "time" => "2022-03-06 04:03:16",
                    "status" => "【成都市】 快件已经到达 【成都中转】"
                ],
                [
                    "time" => "2022-03-04 23:02:55",
                    "status" => "【上海市】 快件离开 【上海浦东中心】 已发往 【成都华阳】"
                ],
                [
                    "time" => "2022-03-04 23:02:45",
                    "status" => "【上海市】 快件已经到达 【上海浦东中心】"
                ],
                [
                    "time" => "2022-03-04 19:01:09",
                    "status" => "【上海市】 快件离开 【浦东金桥】 已发往 【上海浦东中心】"
                ],
                [
                    "time" => "2022-03-04 19:00:34",
                    "status" => "【上海市】 【浦东金桥】（021-80370101） 的 浦东（17317421746） 已揽收"
                ]
            ],
            "deliverystatus" => 3,
            "issign" => 1,
            "typeName" => "EMS快递",
            "isReceived" => false
        ];
        return $data;
    }
}
